# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты 
# высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке 
# растёт N кустов.Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное 
# число ягод — на i-ом кусте выросло ai ягод.В этом фермерском хозяйстве внедрена система автоматического сбора 
# черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей.Собирающий модуль за один 
# заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий 
# модуль, находясь перед некоторым кустом заданной во входном файле грядки.


n=int(input("Введите колличество кустов:"))
arr=list()
for i in range(n):
    x=int(input(f"Куст {i+1} = "))
    arr.append(x)

def Max_Summ(arr):
    List_1=list()
    print (arr)
    for i in range(len(arr)-1):
        List_1.append(arr[i-1] + arr[i] + arr[i+1])
        List_1.append(arr[-2] + arr[-1] + arr[0])
    return max(List_1)

print (Max_Summ(arr))